# Arithemetic and Comparison Operators
---

### Connecting with the database

In [ ]:
%load_ext sql
# replace with your own credentials
%sql ibm_db_sa://my-username:my-password@dashdb-txn-sbox-yp-dal09-03.services.dal.bluemix.net:50000/BLUDB

### • <u>ARITHMETIC OPERATORS</u>
Arithmetic operators can perform arithmetical operations on numeric operands involved. Arithmetic operators are addition(+), subtraction(-), multiplication(*) and division(/).

### 1. SQL plus (+) operator
This operator is used to add two or more expressions or numbers.

In [10]:
%sql select * from STUDENTS where test_score = 31+20

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Celinda', 'Malkin', 51)]

### 2. SQL minus (-) operator
This operator is used to subtract on expression/number from another expression/number.

In [11]:
%sql select * from STUDENTS where test_score = 84-30

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54)]

### 3. SQL multiply (*) operator
This operator is usd to multiply two or more expressions/numbers.

In [12]:
%sql select * from STUDENTS where test_score = 11*5

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Sweden', 'Emlyn', 'Erricker', 55), ('Sweden', 'Sharla', 'Papaccio', 55)]

### 4. SQL divide (/) operator
This operator is used to divide one expression/number by another.

In [13]:
%sql select * from STUDENTS where test_score = 98/2

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Poland', 'Cole', 'Winteringham', 49),
 ('Russia', 'Cathee', 'Sivewright', 49)]

### 5. SQL modulo (%) operator
This operator returns the remainder(an integer) of the division.

In [14]:
%sql select * from STUDENTS where test_score = 100%2
# No row should show up

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[]

### • <u>COMPARISON OPERATORS</u>
Comparison operators are used in conditions that compares one expression with another. The result of a comparison can be TRUE, FALSE, or UNKNOWN (an operator that has one or two NULL expressions returns UNKNOWN).

### 1. EQUALITY operator
This operator tests the equality in the query.

In [15]:
%sql select * from STUDENTS where country = 'Poland'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Poland', 'Cole', 'Winteringham', 49), ('Poland', 'Barny', 'Ingerson', 57)]

### 2. INEQUALITY operator
In SQL, there are two ways to test the inequality in a query. Either by `<>` or by `!=` operator.

In [16]:
%sql select * from STUDENTS where country != 'Poland'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

### 3. GREATER THAN operator
We can use the `>` operator in SQL to test for an expression greater than.

In [17]:
%sql select * from STUDENTS where test_score > 50

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

### 4. GREATER THAN OR EQUAL operator
In SQL, we can use the `>=` operator to test for an expression greater than or equal to.

In [18]:
%sql select * from STUDENTS where test_score >= 55

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Sweden', 'Emlyn', 'Erricker', 55),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

### 5. LESS THAN operator
We can use the `<` operator in SQL to test for an expression less than.

In [19]:
%sql select * from STUDENTS where test_score < 49

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Ukraine', 'Aharon', 'Tunnow', 48), ('Russia', 'Bail', 'Goodwin', 46)]

### 6. LESS THAN OR EQUAL operator
In SQL, we can use the `<=` operator to test for an expression less than or equal to.

In [20]:
%sql select * from STUDENTS where test_score <= 49

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('Russia', 'Cathee', 'Sivewright', 49)]

## Thanks for reading :)
Created by [Tarun Kamboj](https://www.linkedin.com/in/kambojtarun/).